# Numbers
    # s - singular
    # p - Plural

#person
    # 1st - ප්‍රථම
    # 2nd - මධ්‍යම
    # 3rd - උත්තම

Rules = [
    {
        'P': 'Pattern-O1',
        '3rd': [
                {
                    's':[
                        'මම', 'මා'
                    ],
                    'p' : [
                        'අපි', 'අප'
                    ]
                }
            ],          
                  
    },
    {
        'P': 'Pattern-O2',
        '2nd': [
                {
                    's':[
                        'නුඹ', 'තෝ', 'තා', 'ඔබ','තී', 'තෝ', 'යුෂ්මතා'
                    ],
                    'p' : [
                        'නුඹලා', 'තොපි', 'තෙපි', 'ඔබලා', 'තොප', 'යුෂ්මත්හු', 'යුෂ්මතුන්'
                    ]
                }
            ]
    },
    {
        'P': 'Pattern-O3',
        '1st': [
                {
                    's':[
                        'ඔහු', 'ඇය', 'හේ', 'හෙතෙම', 'ඇ', 'ඌ', 'ඕ', 'ඕතමෝ', 'යෙක්', 'යෙකු', 'යක්', 'යක', 'යෙකුගෙන්', 'යෙකුට', 'යෙකුගේ',
                         'වෙක්', 'වෙකු', 'කෙනෙක්', 'නෙකු', 'අයෙක්','ල්ලා', 'ල්ල', 'ා', 'ග', 'ත', 'ල', 'ම', 'ව', 'ිය',' ියෝ', 'රුවෝ', 'වරු', 
                         'වරිය', 'කාව', 'ටුව', 'ලිය', 'කරු', 'ය'
                    ],
                    'p' : [
                        'ඔවුහූ', 'ඔවුන්', 'ස්සු', 'වරුන් ', 'ෝ', 'ල්', 'ස්', 'මෙක්', 'මෙකු', 'යා', 'රෙක්', 'රෙකු', 'ඇතැමෙක්', 'සමහරෙක්', 'යන්', 
                        'න්ගෙන්', 'න්ගේ', 'කරුවන්','න්', 'වරු', 'සුන්', 'වරියන්', 'ටු', 'ට්ටි', 
                    ]
                }
            ],          
                  
    }    
]

Honorific = [   
    'වහන්සේ', 'වහන්දෑ', 'හාමුදුරුවෝ', 'තෙමේ', 'තොමෝ', 'මයා', 'මිය', 'ණියෝ', 'ූ', 'ෑ', ' ාණ' , 'ණු', 'ණුවෝ', 'ණි', 'ණියෝ', 'ණ්ඩි', 'යන්දෑ'   
]

Gender = [
    {
        'Female': [
               'ඇය', 'ඇ', 'නිය', 'ලිය', 'මිය', 'රිය', 'ියෝ', 'විය', 'තුමිය', 'ණියෝ', 'දෙන', 'වරිය', 'වරියන්', 'යාව', 'කාව', 'ිය',  'ාව',
                'ිනි', 'ින්න', 'ානී', 'නී', 'ිල්ලි', 'ැස්සි', 'ළිය', 'ිකාව'
                ],          
                  
    },
    {
        'Male': [
               'ඔහු', 'වුහූ', 'වුන්', 'රුවා', 'රුවෝ', 'ල්ලි', 'වරයා', 'තුමා', 'මයා', 'වරු', 'ධාරියා', 'යා', 'ල්ලා', 'ා'
            ],          
                  
    }
]
