
## LP   - උත්තම පුරුෂ (LORD-PERSON)
## MP   - මධයම පුරුෂ (MIDDLE-PERSON)
## FP   - ප්‍රථම පුරුෂ (FIRST-PERSON)
## SIN  - ඒකවචන (SINGULAR)
## PLU  - බහුවචන (PLURAL)
## MAL  - පුරුෂ ලිංග (MALE)
## FEM  - ස්ත්‍රී ලිංග (FEMALE)
## PRES - වර්තමාන කාල (PRESENT TENSE)
## PAS  - අතීත කාල (PAST TENSE)
## FUT  - අනාගත කාල (FUTURE TENSE)


# Numbers
    # s - singular
    # p - Plural

#person
    # 1st - ප්‍රථම
    # 2nd - මධ්‍යම
    # 3rd - උත්තම

Verb_Rules = [
    {
        'අතීත': [
            {
                'මම': [
                    'කළෙමි', 'ලීවෙමි','පැදවූවෙමි','සිනාසුනෙමි','ගත්තෙමි','යැව්වෙමි','වුණෙමි','බිව්වෙමි'
                    ],
                'අපි' : [
                    'කළෙමු', 'ලීවෙමු','පැදවූවෙමු','කළෙමු','දුන්නෙමු','ගත්තෙමු','කෑවෙමු'
                    ],
                'ඔහු': [
                    'කළේය','ලීවේය','පැදවූයේය','දුන්නේය','සිනාසුනේය','ලැබුණේය','කෑවේය','ගෙනෙනේය'
                ],
                'ඔවුහු': [
                    'දුන්නෝය','කළෝය','මඟහැරියෝය','පත්විය','විය','කළහ'
                ],
                'තෝ': [
                    'ගියෙහි','කළෙහි','ලීවෙහි','කීවෙහි','ගත්තෙහි','යව්වෙහි'
                ],
                'තොපි': [
                   'බැලුවෙහු' ,'කළේහු' ,'ලබුණේහු'
                ],
                'ඇය':[
                    
                ]
            }
        ]
    },
     {
        'වර්තමාන': [
            {
                'මම':[
                    'කරමි','ලියමි','පදවමි','හඩමි','ගනිමි','කියමි','දුවමි'
                    ],
                'අපි' : [
                    'කරමු','පදවමු','ගනිමු','කඩමු','කියමු','දුවමු','දෙමු','යමු'
                    ],
                'ඔහු':[
                    'කරයි','ලියයි','ගනියි','හඬයි','දුවයි','ගෙනෙයි'
                ],
                'ඇය': [
                    'කරයි','ලියයි','ගනියි','හඬයි'
                ],
                'ඔවුහු':[
                    'කරති','ලියති','ගනිති','කඩති','හඬති'
                ],
                'තෝ':[
                    'කරහි','බලහි','කියහි','පනිහි','කෑගසහි'
                ],
                'තොපි':[
                    'කරහු','බලහු','කඩහු',''
                ]
            }
        ]
    },
      {
        'අනාගත': [
            {
                'මම': [
                    'කරන්නෙමි', 'ලියන්නෙමි','පදවන්නෙමි','කරන්නෙමි','දුන්නෙමි'
                    ],
                'අපි' : [
                    'කරන්නෙමු', 'කරමු','සිටියි','පහරදෙමු'
                    ],
                'ඔහු': [
                    'කරන්නේය','පදවන්නේය','දෙන්නේය'
                ],
                'ඔවුහු': [
                    'පදවන්නෝය','දෙන්නෝය','කරන්නෝය','කඩන්නෝය','පහරදෙන්නෝය'
                ],
                'තොපි': [
                    'සිටින්නෙහු','බසින්නෙහු','යන්නෙහු','බලන්නෙහු','අන්දන්නෙහු'
                ],
                'තෝ': [
                    'කරන්නෙහි','නටන්නෙහි','යන්නෙහි','බලන්නෙහි','කඩන්නෙහි'
                ],
                'ඇය': [
                    'නටන්නීය','යන්නීය','කරන්නීය','උයන්නීය','ගන්නීය'
                ],
            }
        ]
    },
]